Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  triggerLedAlert();
}

void snifferCallback(uint8_t *buf, uint16_t len) {
  if (isDeviceLocked || currentMode != MODE_RADAR || len == 12) return;

  struct SnifferPacket *sniffer = (struct SnifferPacket*) buf;
  int rssi = sniffer->rx_ctrl.rssi;

  if (sniffer->buf[0] == 0x40) {
    uint8_t *srcMac = &sniffer->buf[10];
    registerTarget(srcMac, rssi);
  }
}

void triggerWifiScan() {
  scanningInProgress = true;
  WiFi.scanNetworksAsync([](int networksFound) {
    totalNetworksFound = networksFound;
    scanningInProgress = false;
  });
}

void handleRoot() {
  if (currentMode == MODE_AP_CONFIG) {
    WiFi.mode(WIFI_AP_STA);
    int n = WiFi.scanNetworks();

    String html = "<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>body{font-family:Arial,sans-serif;background:#121212;color:#eee;text-align:center;padding:20px;}";
    html += "form{background:#1f1f1f;padding:20px;border-radius:10px;display:inline-block;max-width:320px;width:100%;}";
    html += "select,input{width:90%;padding:10px;margin:10px 0;border-radius:5px;border:none;background:#2a2a2a;color:#fff;}";
    html += "input[type=submit]{background:#00bcd4;color:#fff;font-weight:bold;cursor:pointer;}";
    html += "</style></head><body><h2>Sentinel AP Setup</h2>";
    html += "<form method='POST' action='/save'>";
    html += "<label>Select Nearby Wi-Fi:</label><br><select name='ssid'>";

    if (n == 0) {
      html += "<option value=''>No networks found</option>";
    } else {
      for (int i = 0; i < n; ++i) {
        String s = WiFi.SSID(i);
        s.trim();
        if (s.length() > 0) {
          html += "<option value='" + s + "'>" + s + " (" + String(WiFi.RSSI(i)) + " dBm)</option>";
        }
      }
    }

    html += "</select><br><label>Password:</label><br><input type='password' name='pass'><br>";
    html += "<input type='submit' value='Save & Reboot'></form></body></html>";
    server.send(200, "text/html", html);
  } else {
    server.send(200, "text/plain", "ESP-Sentinel Ready");
  }
}

void handleConfigSave() {
  String reqSSID = server.arg("ssid");
  String reqPass = server.arg("pass");

  if (reqSSID.length() > 0) {
    saveCredentials(reqSSID, reqPass);
    String html = "<html><body style='background:#121212;color:#eee;text-align:center;padding:40px;font-family:Arial;'>";
    html += "<h2>Credentials Saved!</h2><p>Rebooting...</p></body></html>";
    server.send(200, "text/html", html);
    delay(1500);
    ESP.restart();
  } else {
    server.send(400, "text/plain", "SSID cannot be empty.");
  }
}

void configureMode(DeviceMode newMode) {
  currentMode = newMode;
  display.clearDisplay();

  server.stop();
  wifi_promiscuous_enable(0);
  irrecv.disableIRIn();
  digitalWrite(EXTERNAL_LED, LOW);
  alertLedActive = false;

  switch (currentMode) {
    case MODE_RADAR:
      WiFi.persistent(false);
      WiFi.disconnect();
      WiFi.mode(WIFI_STA);
      wifi_set_opmode(STATION_MODE);
      wifi_promiscuous_enable(0);
      wifi_set_promiscuous_rx_cb(snifferCallback);
      wifi_promiscuous_enable(1);
      break;

    case MODE_SCANNER:
      WiFi.mode(WIFI_STA);
      WiFi.disconnect();
      totalNetworksFound = 0;
      triggerWifiScan();
      lastScanTime = millis();
      break;

    case MODE_RF_TRIPWIRE:
      WiFi.mode(WIFI_STA);
      WiFi.setSleepMode(WIFI_NONE_SLEEP);
      WiFi.begin(target_ssid, target_password);
      baselineInitialized = false;
      isCalibrating = false;
      calibrationStartTime = 0;
      maxNoiseObserved = 0.0;
      for (int i = 0; i < WAVE_POINTS; i++) waveBuffer[i] = 42;
      break;

    case MODE_IR_DECODER:
      WiFi.disconnect();
      WiFi.mode(WIFI_OFF);
      irrecv.setUnknownThreshold(12);
      irrecv.enableIRIn();
      break;

    case MODE_AP_CONFIG: {
      WiFi.persistent(false);
      WiFi.disconnect(true);
      delay(50);
      WiFi.mode(WIFI_AP_STA);

      IPAddress local_ip(192, 168, 4, 1);
      IPAddress gateway(192, 168, 4, 1);
      IPAddress subnet(255, 255, 255, 0);
      WiFi.softAPConfig(local_ip, gateway, subnet);
      WiFi.softAP(AP_CONFIG_SSID, AP_CONFIG_PASS, 1, 0, 4);

      server.begin();
      break;
    }
  }
}

void enterLockScreen() {
  isDeviceLocked = true;
  isClockModeActive = false;
  resumeMode = currentMode;

  // Halt active sniffing / sensors to save energy
  wifi_promiscuous_enable(0);
  irrecv.disableIRIn();
  digitalWrite(EXTERNAL_LED, LOW);
  alertLedActive = false;

  display.clearDisplay();
  display.display();
}

void unlockDevice() {
  isDeviceLocked = false;
  lastUserActivity = millis();
  display.clearDisplay();
  configureMode(resumeMode);
}

// EMO-Style Animated Robotic Eyes
void drawEmoFace() {
  unsigned long now = millis();

  // Handle blink cycles
  if (!isBlinking && (now - lastEyeAnim > random(2500, 5000))) {
    isBlinking = true;
    blinkStartTime = now;
    lastEyeAnim = now;

    // Random glance offset
    eyeOffsetX = random(-8, 9);
    eyeOffsetY = random(-4, 5);
  }

  if (isBlinking) {
    if (now - blinkStartTime < 100) {
      eyeHeight = 4; // Eye slits
    } else {
      isBlinking = false;
      eyeHeight = 30; // Eyes fully open
    }
  }

  display.clearDisplay();

  const int eyeW = 28;
  const int eyeCornerR = 7;
  const int leftEyeBaseX = 26;
  const int rightEyeBaseX = 74;
  const int eyeBaseY = 17;

  int lx = constrain(leftEyeBaseX + eyeOffsetX, 4, 46);
  int rx = constrain(rightEyeBaseX + eyeOffsetX, 54, 96);
  int y  = constrain(eyeBaseY + eyeOffsetY, 6, 28);

  // Render left and right rounded EMO eyes
  display.fillRoundRect(lx, y + (30 - eyeHeight) / 2, eyeW, eyeHeight, eyeCornerR, SSD1306_WHITE);
  display.fillRoundRect(rx, y + (30 - eyeHeight) / 2, eyeW, eyeHeight, eyeCornerR, SSD1306_WHITE);

  display.display();
}

void drawClockUI() {
  time_t now = time(nullptr);
  struct tm* timeinfo = localtime(&now);

  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);

  char timeStr[10];
  int hour12 = timeinfo->tm_hour % 12;
  if (hour12 == 0) hour12 = 12;
  const char* ampm = (timeinfo->tm_hour >= 12) ? "PM" : "AM";

  snprintf(timeStr, sizeof(timeStr), "%02d:%02d:%02d", hour12, timeinfo->tm_min, timeinfo->tm_sec);

  display.setTextSize(2);
  display.setCursor(4, 14);
  display.print(timeStr);

