Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  Serial.begin(115200);
  delay(100);

  loadCredentials();

  server.on("/", handleRoot);
  server.on("/save", HTTP_POST, handleConfigSave);

  Wire.begin(OLED_SDA, OLED_SCL);
  display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
  display.setRotation(2);
  display.clearDisplay();
  display.display();

  syncTimeAtStartup();

  lastUserActivity = millis();

  if (currentMode != MODE_AP_CONFIG) {
    configureMode(MODE_RADAR);
  }
}

void loop() {
  unsigned long currentMillis = millis();

  // 1. Universal Non-Blocking Alert LED Pulse Shutoff
  if (alertLedActive && (currentMillis - alertLedStart >= LED_ALERT_DURATION)) {
    alertLedActive = false;
    digitalWrite(EXTERNAL_LED, LOW);
  }

  // 2. Button Engine (Single-Click, Fast Double-Click, and 2-Second Hold)
  if (currentMillis - lastButtonCheck >= 25) {
    lastButtonCheck = currentMillis;
    bool pinState = (digitalRead(BUTTON_PIN) == LOW);

    if (pinState && !buttonIsPressed) {
      // Button Press Event
      buttonIsPressed = true;
      buttonPressStartTime = currentMillis;
      holdThresholdMet = false;
    } 
    else if (pinState && buttonIsPressed) {
      // Holding Down
      unsigned long heldTime = currentMillis - buttonPressStartTime;

      if (!isDeviceLocked && !holdThresholdMet) {
        if (heldTime >= 2000) {
          holdThresholdMet = true;
          clickCount = 0; // Cancel single/double click
          lastUserActivity = currentMillis;
          isClockModeActive = false;
          configureMode(MODE_AP_CONFIG);
        } else if (heldTime >= 400) {
          display.fillRect(10, 56, (heldTime - 400) * 108 / 1600, 4, SSD1306_WHITE);
          display.display();
        }
      }
    } 
    else if (!pinState && buttonIsPressed) {
      // Button Released Event
      buttonIsPressed = false;
      unsigned long duration = currentMillis - buttonPressStartTime;

      if (duration < 600 && !holdThresholdMet) {
        clickCount++;
        lastClickTime = currentMillis;

        if (clickCount == 2) {
          // Double Click Confirmed!
          clickCount = 0;
          if (isDeviceLocked) {
            unlockDevice();
          } else {
            enterLockScreen();
          }
        }
      }
    }

    // Resolve Single Click after gap timeout
    if (clickCount == 1 && (currentMillis - lastClickTime > DOUBLE_CLICK_GAP)) {
      clickCount = 0;
      if (!isDeviceLocked) {
        lastUserActivity = currentMillis;

        if (isClockModeActive) {
          isClockModeActive = false;
          display.clearDisplay();
        } else {
          DeviceMode nextMode;
          if (currentMode == MODE_RADAR)             nextMode = MODE_SCANNER;
          else if (currentMode == MODE_SCANNER)     nextMode = MODE_RF_TRIPWIRE;
          else if (currentMode == MODE_RF_TRIPWIRE) nextMode = MODE_IR_DECODER;
          else                                      nextMode = MODE_RADAR;

          configureMode(nextMode);
        }
      }
    }
  }

  // 3. Automated Locks and Screen Savers
  if (!isDeviceLocked && currentMode != MODE_AP_CONFIG) {
    // 1-minute auto-lock into EMO Face
    if (currentMillis - lastUserActivity >= AUTO_LOCK_MS) {
      enterLockScreen();
    }
    // 20-second clock screensaver (only if not locked)
    else if (!isClockModeActive && (currentMillis - lastUserActivity >= CLOCK_TIMEOUT_MS)) {
      isClockModeActive = true;
      display.clearDisplay();
    }
  }

  // 4. UI Rendering Branches
  if (isDeviceLocked) {
    // Show EMO robotic face; clock and sensors are stopped
    if (currentMillis - lastDisplayDraw >= 40) {
      lastDisplayDraw = currentMillis;
      drawEmoFace();
    }
    return; // Completely bypass background sniffing/sensors while locked
  }

  if (isClockModeActive) {
    if (currentMillis - lastDisplayDraw >= 500) {
      lastDisplayDraw = currentMillis;
      drawClockUI();
    }
  }

  // 5. Active & Background Logic Execution (Only when unlocked)
  switch (currentMode) {
    case MODE_RADAR: {
      if (currentMillis - lastChannelHop >= 180) {
        lastChannelHop = currentMillis;
        currentChannel++;
        if (currentChannel > 13) currentChannel = 1;
        wifi_set_channel(currentChannel);
      }

      if (!isClockModeActive && (currentMillis - lastDisplayDraw >= 50)) {
        lastDisplayDraw = currentMillis;
        sweepAngle += 0.15;
        if (sweepAngle >= 2 * PI) sweepAngle = 0;
        drawRadarUI();
      }
      break;
    }

    case MODE_SCANNER: {
      if (!scanningInProgress && (currentMillis - lastScanTime >= SCAN_INTERVAL)) {
        lastScanTime = currentMillis;
        triggerWifiScan();
      }

      if (!isClockModeActive && (currentMillis - lastDisplayDraw >= 200)) {
        lastDisplayDraw = currentMillis;
        drawScannerUI();
      }
      break;
    }

    case MODE_RF_TRIPWIRE: {
      if (WiFi.status() != WL_CONNECTED) {
        if (!isClockModeActive && (currentMillis - lastDisplayDraw >= 300)) {
          lastDisplayDraw = currentMillis;
          display.clearDisplay();
          display.setTextColor(SSD1306_WHITE);
          display.setTextSize(1);
          display.setCursor(0, 24);
          display.println("Connecting to AP...");
          display.display();
        }
        break;
      }

      if (!baselineInitialized) {
        baselineRSSI = (float)WiFi.RSSI();
        baselineInitialized = true;
        isCalibrating = true;
        calibrationStartTime = currentMillis;
        maxNoiseObserved = 0.0;
        break;
      }

      if (currentMillis - lastSampleTime >= SAMPLE_RATE_MS) {
        lastSampleTime = currentMillis;
        int currentRssi = WiFi.RSSI();

        baselineRSSI = (EMA_ALPHA * (float)currentRssi) + ((1.0 - EMA_ALPHA) * baselineRSSI);
        float delta = abs((float)currentRssi - baselineRSSI);

        if (isCalibrating) {
          if (delta > maxNoiseObserved) {
            maxNoiseObserved = delta;
          }

          unsigned long elapsed = currentMillis - calibrationStartTime;
          if (elapsed >= 5000) {
            dynamicThreshold = maxNoiseObserved + 1.0;
            if (dynamicThreshold < 2.0) dynamicThreshold = 2.0;
            isCalibrating = false;
          }

          if (!isClockModeActive) {
            display.clearDisplay();
            display.setTextColor(SSD1306_WHITE);
            display.setTextSize(1);
            display.setCursor(0, 8);
            display.println("CALIBRATING ROOM...");
            display.setCursor(0, 24);
            display.printf("Remain: %lus", (5000 - elapsed) / 1000 + 1);
            display.setCursor(0, 38);
            display.printf("Noise : %.1fdB", maxNoiseObserved);
            display.setCursor(0, 50);
            display.println("Keep area clear!");
            display.display();
          }
          break;
        }

