Debjit230/ESP8266-EXPERIMENT/src/main.cpp
        if (delta >= dynamicThreshold) {
          lastMotionDetected = currentMillis;
          triggerLedAlert();
        }

        bool isMotionActive = (currentMillis - lastMotionDetected < ALARM_HOLD_TIME);

        int yVal = 42 - (int)(((float)currentRssi - baselineRSSI) * 3.5);
        yVal = constrain(yVal, 22, 62);

        waveBuffer[waveIndex] = yVal;
        waveIndex = (waveIndex + 1) % WAVE_POINTS;

        if (!isClockModeActive) {
          drawTripwireUI(delta, currentRssi, isMotionActive);
        }
      }
      break;
    }

    case MODE_IR_DECODER: {
      if (irrecv.decode(&irResults)) {
        bool isValidSignal = (irResults.decode_type != decode_type_t::UNKNOWN) &&
                             (irResults.bits >= 8) &&
                             (irResults.value != 0);

        if (isValidSignal) {
          lastProtocol = typeToString(irResults.decode_type);
          lastHexCode  = "0x" + uint64ToString(irResults.value, HEX);
          lastBits     = irResults.bits;

          triggerLedAlert();
          lastUserActivity = currentMillis;
          if (isClockModeActive) {
            isClockModeActive = false;
            display.clearDisplay();
          }
        }
        irrecv.resume();
      }

      if (!isClockModeActive && (currentMillis - lastDisplayDraw >= 100)) {
        lastDisplayDraw = currentMillis;
        drawDecoderUI();
      }
      break;
    }

    case MODE_AP_CONFIG: {
      server.handleClient();

      if (currentMillis - lastDisplayDraw >= 300) {
        lastDisplayDraw = currentMillis;
        drawConfigUI();
      }
      break;
    }
  }
}